# Begin 1
'''
Дана сторона квадрата a. Найти его периметр P = 4·a.
'''

a = int(input("введите а: "))
p = 4*a
print("Периметр = ", p);
