# Begin 1 С функциями
'''
Дана сторона квадрата a. Найти его периметр P = 4·a.
'''

def vvod():
    global a
    a = input("введите а: ")

def proverka():
    global a
    print(a)

def raschet():
    pass

def vyvod():
    pass

a = ''
vvod()
proverka()
raschet()
vyvod()
